/* eslint-disable max-len */

// 手机号正则
export const mobileReg = /^1[3-9][0-9]{9}$/;

// 邮箱正则
export const emailReg = /^[a-zA-Z0-9_-]+@[a-zA-Z0-9_-]+(.[a-zA-Z0-9_-]+)+$/;

// 密码正则 6-20位，大小写字母、数字、特殊字符
export const passwordReg = /^[\da-zA-Z!"#$%&'()*+,-./:;<=>?@[\]^_`{|}~]{6,20}$/;

// 密码正则 6-20位，字母、数字、符号至少2种组合
export const passwordReg2 = /^(?![\d]+$)(?![a-zA-Z]+$)(?![!"#$%&'()*+,-./:;<=>?@[\]^_`{|}~]+$).{6,20}$/;

// 密码正则 8-20位，大小写字母+数字+特殊符号
export const passwordReg3 =
  /^(?=.*\d)(?=.*[a-z])(?=.*[A-Z])(?=.*[!"#$%&'()*+,-./:;<=>?@[\]^_`{|}~])[\da-zA-Z!"#$%&'()*+,-./:;<=>?@[\]^_`{|}~]{8,20}$/;
